tap "boardzilla/tap"
tap "coursier/formulas"
tap "edgedb/tap"
tap "homebrew/bundle"
tap "lampepfl/brew"
tap "tidbyt/tidbyt"
brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git-delta"
brew "go"
brew "golangci-lint"
brew "hugo"
brew "jq"
brew "just"
brew "lazygit"
brew "mise"
brew "railway"
brew "ripgrep"
brew "starship"
brew "tldr"
brew "uv"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "font-jetbrains-mono-nerd-font"
vscode "astro-build.astro-vscode"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "james-yu.latex-workshop"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ninoseki.vscode-mogami"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "maelstrom-echo"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "cl-wordle"
